login.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com">
    <soapenv:Body>
        <urn:login>
            <urn:username>USERNAME</urn:username>
            <urn:password>PASSWORDACCESSKEY</urn:password>
        </urn:login>
    </soapenv:Body>
</soapenv:Envelope>